snlkuharlocal/src/Documents/Доставка/Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Доставка</name>
  <registerRecords>AccumulationRegister.ПлановаяСтоимостьДоставки</registerRecords>
  <attributes>
    <name>ДатаПриемки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаПаллетыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаОбъемПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаШтукиПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьРучнаяПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШтук</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсеСчетаОплачены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПолучателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифДоставки</name>
    <type>
      <types>CatalogRef.ТарифыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПунктаДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаОбъемПланТариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаОбъемПланКилометраж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаОбъемПланАвизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаОбъемПланЭкспедирование</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаОбъемПланПогрузка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаОбъемПланДоставкаДоТК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатитьДоставкуДоТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокУСО</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.УслугиСтороннихОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокНакладных</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоШтук</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/РеквизитыРНКПНКПРМ/РеквизитыРНКПНКПРМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыРНКПНКПРМ</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/РеквизитыСправочников/РеквизитыСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыСправочников</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Справочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/ПлановаяСтоимостьДоставки/ПлановаяСтоимостьДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПлановаяСтоимостьДоставки</name>
  <resources>
    <name>РаспределеннаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемНаладной</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНакладной</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоНакладной</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУслуги</name>
    <type>
      <types>CatalogRef.ВидыУслуг</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Catalogs/ТарифыДоставки/ТарифыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТарифыДоставки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТарифНаШтуки</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифНаОбъем</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифНаПаллеты</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьКМзаШтуки</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьКМЗаОбъем</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьКМЗаПаллеты</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьАвизацииЗаШтуки</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьАвизацииЗаОбъем</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьАвизацииЗаПаллеты</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЭкспедированияЗаШтуки</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЭкспедированияЗаОбъем</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЭкспедированияЗаПаллеты</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПогрузкиЗаШтуки</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПогрузкиЗаОбъем</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПогрузкиЗаПаллеты</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиДоТКЗаШтуки</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиДоТКЗаОбъем</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиДоТКЗапаллеты</name>
    <type>
      <types>CatalogRef.СтоимостиДоставки</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Documents/Доставка/ObjectModule.bsl
Перем СтоимостьКМзаШтуки;	
Перем СтоимостьКМЗаПаллеты;	
Перем СтоимостьКМЗаОбъем;	
//крохин начало 13.01.2019
//новые реквизиты
Перем СтоимостьАвизацииЗаШтуки;	
Перем СтоимостьАвизацииЗаПаллеты;	
Перем СтоимостьАвизацииЗаОбъем;
Перем СтоимостьЭкспедированияЗаШтуки;	
Перем СтоимостьЭкспедированияЗаПаллеты;	
Перем СтоимостьЭкспедированияЗаОбъем;
Перем СтоимостьПогрузкиЗаШтуки;
Перем СтоимостьПогрузкиЗаОбъем;
Перем СтоимостьПогрузкиЗаПаллеты;
//крохин конец 13.01.2019

//крохин начало 03.02.2019
Перем СтоимостьДоставкиДоТКЗаШтуки;
Перем СтоимостьДоставкиДоТКЗаОбъем;
Перем СтоимостьДоставкиДоТКЗаПаллеты;
//крохин конец 03.02.2019



Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ОбменДанными.Загрузка Тогда		
		НужноВыгружать=ложь;
	иначе
		//Кухарь 26.12.18 начало
		//Установка номера
		если ЭтоНовый() тогда
			
			Префикс=ПараметрыСеанса.ЭтотУзел.Код;
			УстановитьНовыйНомер(Префикс+"-");	
			//крохин начало 25.01.2019
			дата=ДатаОтгрузки;
			//крохин конец 25.01.2019
			
			//крохин начало 14.02.2019
			//новый алгоритм расчета тарифов, от объема, поэтому после вычисления объема заполняем. Плюс незаполненный тариф рассчитываем для любых документов, а не только новых
			//		//крохин начало 13.01.2019
			//		//тарифы можно менять руками
			//		Если ТарифДоставки.Пустая() Тогда
			//
			//		//теперь тариф зависит от автомобиля, и запрещено создавать с пустым тарифом
			//		//Если ЗначениеЗаполнено(ПунктДоставки.ТарифДоставки) тогда
			//		//	ТекТариф=ПунктДоставки.ТарифДоставки;
			//		//ИначеЕсли ЗначениеЗаполнено(ПунктДоставки.Регион.ТарифДоставки) тогда
			//		//	ТекТариф=ПунктДоставки.Регион.ТарифДоставки;
			//		//иначе ТекТариф=Справочники.ТарифыДоставки.ПустаяСсылка();
			//		//КонецЕсли;
			//		//крохин начало 14.02.2019
			//		Если Автомобиль.ТипДоставкиАвтомобиля = Перечисления.ТипДоставкиАвтомобиля.ПрямаяДоставка Тогда
			//			ТарифДоставки = ПунктДоставки.Регион.ТарифДоставки;
			//			Если ТарифДоставки.Пустая() Тогда
			//			#Если Клиент  Тогда
			//			Сообщить("Не указан тариф для региона "+ПунктДоставки.Регион+"! Документ ""доставка"" не записан!"); 	
			//		#КОНЕЦЕСЛИ
			//		Отказ = Истина;	
			//			КонецЕсли;
			//		ИначеЕсли Автомобиль.ТипДоставкиАвтомобиля = Перечисления.ТипДоставкиАвтомобиля.СборнаяДоставка Тогда
			//			ТарифДоставки = ПунктДоставки.ТарифДоставки;
			//			Если ТарифДоставки.Пустая() Тогда
			//			#Если Клиент Тогда
			//			Сообщить("Не указан тариф для пункта доставки "+ПунктДоставки+"("+ПунктДоставки.Владелец+ ")! Документ ""доставка"" не записан!"); 	
			//		#КОНЕЦЕСЛИ
			//		Отказ = Истина;	
			//			КонецЕсли;
			//		Иначе
			//			#Если Клиент Тогда
			//			Сообщить("Не указан тип доставки автомобиля! Документ ""доставка"" не записан!"); 	
			//		#КОНЕЦЕСЛИ
			//		Отказ = Истина;
			//		КонецЕсли;
			//	   
			//		//крохин конец 25.01.2019
			//		
			//		КонецЕсли;
			//	//крохин конец 13.01.2019
			
			//	КонецЕсли;
			//	//Кухарь 26.12.18 конец
		КонецЕсли;
		//крохин конец 14.02.2019
		
		//крохин начало 27.12.2018
		//Объем считаем с паллетами
		//Объем=СписокНакладных.Итог("Объем");
		//крохин начало 15.01.2019
		//объем такой же, как в УСО
		//Объем=СписокНакладных.Итог("Объем")+0.15*Окр(СписокНакладных.Итог("КоличествоПаллет"),0);
		//крохин начало 25.01.2019
		//пересчитывать надо всегда
		//ЕстьИзменения		=Модифицированность();
		//Если ЕстьИзменения Тогда
		Если Истина Тогда
			//крохин конец 25.01.2019	
			для каждого СтрТЧ из СписокНакладных цикл
				Накл=СтрТЧ.Документ;
				Если Накл.Метаданные().Имя = "РасходнаяНакладная" ИЛИ Накл.Метаданные().Имя = "Перемещение" Тогда
					ОбъемПаллет=Накл.ОбъемПаллет;
				Иначе
					ОбъемПаллет=0;
				КонецЕсли;;
				//крохин начало 25.01.2019
				//атавизм, плюс в этот момент для нового документа даты ещё нет
				//Если  Дата >= '20180301' и ОбъемПаллет>0 тогда				
				Если ОбъемПаллет > 0 Тогда
					//крохин конец 25.01.2019	
					СтрТЧ.Объем=ОбъемПаллет;			
				ИначеЕсли Накл.ОбъемКоробов=0 тогда			
					СтрТЧ.Объем=Накл.ОбъемДокумента;
					
				иначе				
					СтрТЧ.Объем=Накл.ОбъемКоробов;
				Конецесли;					
				
			КонецЦикла;
		КонецЕсли;
		Объем=СписокНакладных.Итог("Объем");
		
		//крохин начало 21.02.2019
		//пункт доставки, получатель и адрес получателя теперь считаем по первой строке ТЧ, так как 
		//сворачиваем по адресу пункта доставки, который может быть одинаковым у разных ПД
		Если ПунктДоставки.Пустая() И СписокНакладных.Количество() > 0 Тогда
			ПунктДоставки = СписокНакладных[0].ПунктДоставки;
			Получатель = ПунктДоставки.Владелец;
			АдресПолучателя = ПунктДоставки.АдресПолучателя;
		КонецЕсли;
		
		//крохин конец 21.02.2019
		
		//крохин начало 13.09.2019
		//для автомобилей с категорией "2" тариф используется из накладной
		Если ТарифДоставки.Пустая() И Автомобиль.КатегорияАвтомобиля = "2" Тогда
			ЗапВРег=РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();	
			ЗапВРег.Отбор.ИмяРеквизита.значение="ТарифДоставки";
			ЗапВРег.Отбор.Документ.значение=СписокНакладных[0].Документ;
			ЗапВРег.Отбор.ИмяРеквизита.использование=Истина;
			ЗапВРег.Отбор.Документ.использование=Истина;	
			ЗапВРег.Прочитать();
			для каждого СтрЗР из ЗапВРег цикл
				ТарифДоставки=СтрЗР.ЗначениеРеквизита;
			КонецЦикла;
			
		КонецЕсли;
		//крохин конец 13.09.2019
		
		//крохин начало 14.02.2019
		Если ТарифДоставки.Пустая() Тогда
			Если Объем >= ПунктДоставки.ОбъемДляСменыТарифаНаРегиональный Тогда
				ТарифДоставки = ПунктДоставки.Регион.ТарифДоставки;	
				Если ТарифДоставки.Пустая() Тогда 
					#Если Клиент  Тогда
						Сообщить("Не указан тариф для региона "+ПунктДоставки.Регион+"! Документ ""доставка"" не записан!"); 
						//крохин начало 03.03.2019
						Сообщить("Дата отгрузки "+Формат(ДатаОтгрузки));
						Сообщить("Накладная: " + СписокНакладных[0].Документ);
						//крохин конец 03.03.2019
					#КОНЕЦЕСЛИ
					Отказ = Истина;
				КонецЕсли;
			Иначе
				//крохин начало 29.05.2019
				//ТарифДоставки = ПунктДоставки.ТарифДоставки;
				ЗапВРег=РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();	
				ЗапВРег.Отбор.ИмяРеквизита.значение="ТарифДоставки";
				ЗапВРег.Отбор.Документ.значение=СписокНакладных[0].Документ;
				ЗапВРег.Отбор.ИмяРеквизита.использование=Истина;
				ЗапВРег.Отбор.Документ.использование=Истина;	
				ЗапВРег.Прочитать();
				для каждого СтрЗР из ЗапВРег цикл
					ТарифДоставки=СтрЗР.ЗначениеРеквизита;
				КонецЦикла;
				Если ТарифДоставки.Пустая() Тогда
					ТарифДоставки = ПунктДоставки.ТарифДоставки;
				КонецЕсли;
				//крохин конец 29.05.2019
				Если ТарифДоставки.Пустая() Тогда
					#Если Клиент Тогда
						Сообщить("Не указан тариф для пункта доставки "+ПунктДоставки+"("+ПунктДоставки.Владелец+ ")! Документ ""доставка"" не записан!"); 
						//крохин начало 03.03.2019
						Сообщить("Дата отгрузки "+Формат(ДатаОтгрузки));
						Сообщить("Накладная: " + СписокНакладных[0].Документ);
						//крохин конец 03.03.2019
					#КОНЕЦЕСЛИ
					Отказ = Истина;	
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		//крохин конец 14.02.2019
		
		//крохин начало 03.03.2019
		Если Автомобиль.Пустая() Тогда
			#Если Клиент Тогда
				Сообщить("Не указан автомобиль! Документ ""доставка"" не записан!"); 	
			#КОНЕЦЕСЛИ
			Отказ = Истина;
		КонецЕсли;
		//крохин конец 03.03.2019
		
		//крохин конец 15.01.0219
		//крохин конец 27.12.2018
		КоличествоШтук=СписокНакладных.Итог("КоличествоШтук");
		КоличествоПаллет=Окр(СписокНакладных.Итог("КоличествоПаллет"),0);
		//крохин начало 25.01.2019
		//дата нужна раньше
		//дата=ДатаОтгрузки;
		//крохин конец 25.01.2019
		
		РасчитатьПлановыеСтоимости();	
		НужноВыгружать=Истина;
	КонецЕсли;	
	
	Если НужноВыгружать Тогда
		//Кухарь 14.01.18 начало
		//Теперь не выгружаем
		//УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		//Кухарь 14.01.18 конец		
	КонецЕсли;
КонецПроцедуры


Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	//Кухарь 26.12.18 начало
	//Убрал всё в перед записью
	//СтандартнаяОбработка=Истина;
	//если СокрЛП(Префикс)="" тогда
	//	//Кухарь 25.12.18 начало
	//	//Процедура недоступна на сервере
	//	//УстановитьНомерДокумента(ЭтотОбъект);
	//	Префикс=ПараметрыСеанса.ЭтотУзел.Код;
	//	УстановитьНовыйНомер(Префикс+"-");
	//	//Кухарь 25.12.18 конец
	//КонецЕсли;
	//Кухарь 26.12.18 конец
КонецПроцедуры



Процедура РасчитатьПлановыеСтоимости()
	//крохин начало 13.01.2019
	//тарифы можно менять руками
	//Если ЗначениеЗаполнено(ПунктДоставки.ТарифДоставки) тогда
	//	ТекТариф=ПунктДоставки.ТарифДоставки;
	//ИначеЕсли ЗначениеЗаполнено(ПунктДоставки.Регион.ТарифДоставки) тогда
	//	ТекТариф=ПунктДоставки.Регион.ТарифДоставки;
	//иначе ТекТариф=Справочники.ТарифыДоставки.ПустаяСсылка();
	//КонецЕсли;
	ТекТариф = ТарифДоставки;
	//крохин конец 13.01.2019
	
	если ТекТариф=Справочники.ТарифыДоставки.ПустаяСсылка() тогда
		СтоимостьЗаПаллетыПлан=0;
		СтоимостьЗаОбъемПлан=0;
		СтоимостьЗаШтукиПлан=0;
		//крохин начало 24.02.2019
		СтоимостьЗаОбъемПланТариф = 0;
		СтоимостьЗаОбъемПланКилометраж = 0;
		СтоимостьЗаОбъемПланАвизация = 0;
		СтоимостьЗаОбъемПланЭкспедирование = 0;
		СтоимостьЗаОбъемПланПогрузка = 0;
		СтоимостьЗаОбъемПланДоставкаДоТК = 0;
		//крохин конец 24.02.2019
		Возврат;
	КонецЕсли;
	
	РасчитатьПоправкуЗаКилометраж(ТекТариф);
	//крохин начало 13.01.2019
	//новые реквизиты
	РассчитатьПоправкуЗаАвизацию(ТекТариф);
	РассчитатьПоправкуЗаЭкспедирование(ТекТариф);
	РассчитатьПоправкуЗаПогрузку(ТекТариф);
	//крохин конец 13.01.2019
	
	//крохин начало 03.02.2019
	РассчитатьПоправкуЗаДоставкуДоТК(ТекТариф);
	//крохин конец 03.02.2019
	
	
	СтоимШтук=0;
	НашлиСтрочку=ложь;
	ПредыдущееЗначение=0;
	если ТекТариф.ТарифНаШтуки.ПорогиСтоимости.Количество()>0 тогда
		для каждого СтрПорогов из ТекТариф.ТарифНаШтуки.ПорогиСтоимости цикл
			если КоличествоШтук>СтрПорогов.Значение тогда 
				ПредыдущееЗначение=СтрПорогов.стоимость;
				Продолжить;
			ИначеЕсли  КоличествоШтук=СтрПорогов.Значение тогда
				СтоимШтук=СтрПорогов.стоимость;
			иначе
				СтоимШтук=ПредыдущееЗначение;
				НашлиСтрочку=Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		
		если НашлиСтрочку=ложь тогда
			СтоимШтук=ТекТариф.ТарифНаШтуки.ПорогиСтоимости.Получить(ТекТариф.ТарифНаШтуки.ПорогиСтоимости.Количество()-1).Стоимость;
		КонецЕсли;	
	Иначе
		СтоимШтук=0;
	КонецЕсли;
	//крохин начало 13.01.2019
	//базовая стоимость не используется + новые реквизиты
	//ИтогоЗаШтуки=СтоимШтук*(ТекТариф.БазоваяСтоимость+СтоимостьКМзаШтуки);
	//крохин начало 03.02.2019
	//ИтогоЗаШтуки = СтоимШтук*КоличествоШтук + СтоимостьКМзаШтуки + СтоимостьАвизацииЗаШтуки + СтоимостьЭкспедированияЗаШтуки+СтоимостьПогрузкиЗаШтуки;
	ИтогоЗаШтуки = СтоимШтук*КоличествоШтук + СтоимостьКМзаШтуки + СтоимостьАвизацииЗаШтуки + СтоимостьЭкспедированияЗаШтуки+СтоимостьПогрузкиЗаШтуки+СтоимостьДоставкиДоТКЗаШтуки*КоличествоШтук;
	//крохин конец 03.02.2019
	//крохин конец 13.01.2019
	
	
	СтоимПаллет=0;
	НашлиСтрочку=ложь;
	ПредыдущееЗначение=0;
	
	если ТекТариф.ТарифНаПаллеты.ПорогиСтоимости.Количество()>0 тогда
		для каждого СтрПорогов из ТекТариф.ТарифНаПаллеты.ПорогиСтоимости цикл
			если КоличествоПаллет>СтрПорогов.Значение тогда 
				ПредыдущееЗначение=СтрПорогов.стоимость;
				Продолжить;
			ИначеЕсли  КоличествоПаллет=СтрПорогов.Значение тогда
				СтоимПаллет=СтрПорогов.стоимость;
				
			иначе
				СтоимПаллет=ПредыдущееЗначение;
				НашлиСтрочку=Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		
		если НашлиСтрочку=ложь тогда
			СтоимПаллет=ТекТариф.ТарифНаПаллеты.ПорогиСтоимости.Получить(ТекТариф.ТарифНаПаллеты.ПорогиСтоимости.Количество()-1).Стоимость;
		КонецЕсли;	
	Иначе
		СтоимПаллет=0;
	КонецЕсли;
	//крохин начало 13.01.2019
	//базовая стоимость не используется + новые реквизиты
	//ИтогоЗаПаллеты=СтоимПаллет*(ТекТариф.БазоваяСтоимость+СтоимостьКМЗаПаллеты);
	//крохин начало 03.02.2019
	//ИтогоЗаПаллеты=СтоимПаллет*КоличествоПаллет+СтоимостьКМЗаПаллеты+СтоимостьАвизацииЗаПаллеты+СтоимостьЭкспедированияЗаПаллеты+СтоимостьПогрузкиЗаПаллеты;
	ИтогоЗаПаллеты=СтоимПаллет*КоличествоПаллет+СтоимостьКМЗаПаллеты+СтоимостьАвизацииЗаПаллеты+СтоимостьЭкспедированияЗаПаллеты+СтоимостьПогрузкиЗаПаллеты+СтоимостьДоставкиДоТКЗаПаллеты*КоличествоПаллет;
	//крохин конец 13.01.2019
	
	
	
	СтоимОбъем=0;
	НашлиСтрочку=ложь;
	ПредыдущееЗначение=0;
	
	если ТекТариф.ТарифНаОбъем.ПорогиСтоимости.Количество()>0 тогда
		для каждого СтрПорогов из ТекТариф.ТарифНаОбъем.ПорогиСтоимости цикл
			если Объем>СтрПорогов.Значение тогда 
				ПредыдущееЗначение=СтрПорогов.стоимость;
				Продолжить;
			ИначеЕсли  Объем=СтрПорогов.Значение тогда
				СтоимОбъем=СтрПорогов.стоимость;
				
			иначе
				СтоимОбъем=ПредыдущееЗначение;
				НашлиСтрочку=Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		
		если НашлиСтрочку=ложь тогда
			СтоимОбъем=ТекТариф.ТарифНаОбъем.ПорогиСтоимости.Получить(ТекТариф.ТарифНаОбъем.ПорогиСтоимости.Количество()-1).Стоимость;
		КонецЕсли;	
	Иначе
		СтоимОбъем=0;
	КонецЕсли;
	//крохин начало 26.12.2018
	//БазоваяСтоимость не нужна при расчете за километраж
	//ИтогоЗаОбъем=СтоимОбъем*(ТекТариф.БазоваяСтоимость+СтоимостьКМЗаОбъем);
	//крохин начало 13.01.2019
	//новые реквизиты
	//ИтогоЗаОбъем=СтоимОбъем*Объем+СтоимостьКМЗаОбъем;
	//крохин начало 03.02.2019
	//ИтогоЗаОбъем=СтоимОбъем*Объем+СтоимостьКМЗаОбъем+СтоимостьАвизацииЗаОбъем+СтоимостьЭкспедированияЗаОбъем+СтоимостьПогрузкиЗаОбъем;
	ИтогоЗаОбъем=СтоимОбъем*Объем+СтоимостьКМЗаОбъем+СтоимостьАвизацииЗаОбъем+СтоимостьЭкспедированияЗаОбъем+СтоимостьПогрузкиЗаОбъем+СтоимостьДоставкиДоТКЗаОбъем*Объем;
	//крохин конец 03.02.2019
	//крохин конец 13.01.2019
	//крохин конец 26.12.2018
	
	
	СтоимостьЗаОбъемПланКилометраж = СтоимостьКМЗаОбъем;
	СтоимостьЗаОбъемПланАвизация = СтоимостьАвизацииЗаОбъем;
	СтоимостьЗаОбъемПланЭкспедирование = СтоимостьЭкспедированияЗаОбъем;
	СтоимостьЗаОбъемПланПогрузка = СтоимостьПогрузкиЗаОбъем;
	СтоимостьЗаОбъемПланДоставкаДоТК = СтоимостьДоставкиДоТКЗаОбъем*Объем;
	//крохин конец 24.02.2019
	
	
	
	
	
	СтоимостьЗаПаллетыПлан=ИтогоЗаПаллеты;	
	СтоимостьЗаОбъемПлан=ИтогоЗаОбъем;	
	СтоимостьЗаШтукиПлан=ИтогоЗаШтуки;
	
	
	//крохин начало 24.02.2019
	// Кухарь А.Ю.  08.02.2023 начало
	// СтоимостьЗаОбъемПланТариф = СтоимОбъем*Объем;
	СтоимостьЗаОбъемПланТариф = СтоимОбъем*Объем+СтоимостьЗаПаллетыПлан;
	// Кухарь А.Ю.  08.02.2023 конец
	
	
	
КонецПроцедуры



Процедура РасчитатьПоправкуЗаКилометраж (ТекТариф)
	
	СтоимостьКМзаШтуки=0;	
	СтоимостьКМЗаПаллеты=0;	
	СтоимостьКМЗаОбъем=0;	
	
	если ТекТариф=Справочники.ТарифыДоставки.ПустаяСсылка() тогда
		Возврат;
	КонецЕсли;
	если ложь тогда
		ТекТариф=Справочники.ТарифыДоставки.ПустаяСсылка()
	КонецЕсли;
	
	Километраж=0;
	если ПунктДоставки.Километраж>0 тогда
		Километраж=ПунктДоставки.Километраж;
	иначе
		Километраж=ПунктДоставки.РайонДоставки.РасстояниеДоСклада;
	КонецЕсли;
	
	если Километраж=0 тогда 
		Возврат;
	КонецЕсли;
	
	
	если ЗначениеЗаполнено(ТекТариф.СтоимостьКМЗаОбъем) тогда
		//СтоимостьКМЗаОбъем=0;
		НашлиСтрочку=ложь;
		ПредыдущееЗначение=0;	
		если ТекТариф.СтоимостьКМЗаОбъем.ПорогиСтоимости.Количество()>0 тогда
			для каждого СтрПорогов из ТекТариф.СтоимостьКМЗаОбъем.ПорогиСтоимости цикл
				если Объем>СтрПорогов.Значение тогда 
					ПредыдущееЗначение=СтрПорогов.стоимость;
					Продолжить;
				ИначеЕсли  Объем=СтрПорогов.Значение тогда
					СтоимостьКМЗаОбъем=СтрПорогов.стоимость;
					
				иначе
					СтоимостьКМЗаОбъем=ПредыдущееЗначение;
					НашлиСтрочку=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			
			если НашлиСтрочку=ложь тогда
				//крохин начало 23.03.2019
				//опечатка
				//СтоимостьКМЗаОбъем=ТекТариф.ТарифНаОбъем.ПорогиСтоимости.Получить(ТекТариф.СтоимостьКМЗаОбъем.ПорогиСтоимости.Количество()-1).Стоимость;
				СтоимостьКМЗаОбъем=ТекТариф.СтоимостьКМЗаОбъем.ПорогиСтоимости.Получить(ТекТариф.СтоимостьКМЗаОбъем.ПорогиСтоимости.Количество()-1).Стоимость;
				//крохин конец 23.03.2019
			КонецЕсли;	
		Иначе
			СтоимостьКМЗаОбъем=0;
		КонецЕсли;		
	КонецЕсли;
	
	
	если ЗначениеЗаполнено(ТекТариф.СтоимостьКМЗаПаллеты) тогда
		//СтоимостьКМЗаПаллеты=0;
		НашлиСтрочку=ложь;
		ПредыдущееЗначение=0;	
		если ТекТариф.СтоимостьКМЗаПаллеты.ПорогиСтоимости.Количество()>0 тогда
			для каждого СтрПорогов из ТекТариф.СтоимостьКМЗаПаллеты.ПорогиСтоимости цикл
				если КоличествоПаллет>СтрПорогов.Значение тогда 
					ПредыдущееЗначение=СтрПорогов.стоимость;
					Продолжить;
				ИначеЕсли  КоличествоПаллет=СтрПорогов.Значение тогда
					СтоимостьКМЗаПаллеты=СтрПорогов.стоимость;
					
				иначе
					СтоимостьКМЗаПаллеты=ПредыдущееЗначение;
					НашлиСтрочку=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			если НашлиСтрочку=ложь тогда
				СтоимостьКМЗаПаллеты=ТекТариф.СтоимостьКМЗаПаллеты.ПорогиСтоимости.Получить(ТекТариф.СтоимостьКМЗаПаллеты.ПорогиСтоимости.Количество()-1).Стоимость;
			КонецЕсли;	
		Иначе
			СтоимостьКМЗаПаллеты=0;
		КонецЕсли;		
	КонецЕсли;
	
	
	
	если ЗначениеЗаполнено(ТекТариф.СтоимостьКМзаШтуки) тогда
		//СтоимостьКМзаШтуки=0;
		НашлиСтрочку=ложь;
		ПредыдущееЗначение=0;	
		если ТекТариф.СтоимостьКМзаШтуки.ПорогиСтоимости.Количество()>0 тогда
			для каждого СтрПорогов из ТекТариф.СтоимостьКМзаШтуки.ПорогиСтоимости цикл
				если КоличествоШтук>СтрПорогов.Значение тогда 
					ПредыдущееЗначение=СтрПорогов.стоимость;
					Продолжить;
				ИначеЕсли  КоличествоШтук=СтрПорогов.Значение тогда
					СтоимостьКМзаШтуки=СтрПорогов.стоимость;
					
				иначе
					СтоимостьКМзаШтуки=ПредыдущееЗначение;
					НашлиСтрочку=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			если НашлиСтрочку=ложь тогда
				СтоимостьКМзаШтуки=ТекТариф.СтоимостьКМзаШтуки.ПорогиСтоимости.Получить(ТекТариф.СтоимостьКМзаШтуки.ПорогиСтоимости.Количество()-1).Стоимость;
			КонецЕсли;	
		Иначе
			СтоимостьКМзаШтуки=0;
		КонецЕсли;		
	КонецЕсли;
	
	СтоимостьКМзаШтуки=СтоимостьКМзаШтуки*Километраж;	
	СтоимостьКМЗаПаллеты=СтоимостьКМЗаПаллеты*Километраж;	
	СтоимостьКМЗаОбъем=СтоимостьКМЗаОбъем*Километраж;	
	
	//если ТекТариф.БазоваяСтоимость>0 тогда
	//	ПоправкаНаШт=СтоимостьКМзаШтуки/ТекТариф.БазоваяСтоимость;
	//	ПоправкаНаПаллет=СтоимостьКМЗаПаллеты/ТекТариф.БазоваяСтоимость;
	//	ПоправкаНаОбъем=СтоимостьКМЗаОбъем/ТекТариф.БазоваяСтоимость;
	//иначе
	//	ПоправкаНаШт=СтоимостьКМзаШтуки;
	//	ПоправкаНаПаллет=СтоимостьКМЗаПаллеты;
	//	ПоправкаНаОбъем=СтоимостьКМЗаОбъем;
	//КонецЕсли;
	
	
	
	
КонецПроцедуры

Процедура РассчитатьПоправкуЗаАвизацию(ТекТариф)
	
	СтоимостьАвизацииЗаШтуки=0;	
	СтоимостьАвизацииЗаПаллеты=0;	
	СтоимостьАвизацииЗаОбъем=0;	
	
	если ТекТариф=Справочники.ТарифыДоставки.ПустаяСсылка() тогда
		Возврат;
	КонецЕсли;
	если ложь тогда
		ТекТариф=Справочники.ТарифыДоставки.ПустаяСсылка()
	КонецЕсли;
	
	//Километраж=0;
	//если ПунктДоставки.Километраж>0 тогда
	//	Километраж=ПунктДоставки.Километраж;
	//иначе
	//	Километраж=ПунктДоставки.РайонДоставки.РасстояниеДоСклада;
	//КонецЕсли;
	//
	//если Километраж=0 тогда 
	//	Возврат;
	//КонецЕсли;
	
	//крохин начало 16.04.2019
	БесплатнаяАвизация = Ложь;
	ЗапВРег=РегистрыСведений.РеквизитыСправочников.СоздатьНаборЗаписей();	
	ЗапВРег.Отбор.ИмяРеквизита.значение="БесплатнаяАвизация";
	ЗапВРег.Отбор.Справочник.значение=ПунктДоставки;
	ЗапВРег.Отбор.ИмяРеквизита.использование=Истина;
	ЗапВРег.Отбор.Справочник.использование=Истина;
	
	ЗапВРег.Прочитать();
	для каждого СтрЗР из ЗапВРег цикл
		БесплатнаяАвизация=СтрЗР.ЗначениеРеквизита;
	КонецЦикла;
	Если БесплатнаяАвизация Тогда
		Возврат;
	КонецЕсли;
	//крохин конец 16.04.2019
	
	
	если ЗначениеЗаполнено(ТекТариф.СтоимостьАвизацииЗаОбъем) тогда
		//СтоимостьКМЗаОбъем=0;
		НашлиСтрочку=ложь;
		ПредыдущееЗначение=0;	
		если ТекТариф.СтоимостьАвизацииЗаОбъем.ПорогиСтоимости.Количество()>0 тогда
			для каждого СтрПорогов из ТекТариф.СтоимостьАвизацииЗаОбъем.ПорогиСтоимости цикл
				если Объем>СтрПорогов.Значение тогда 
					ПредыдущееЗначение=СтрПорогов.стоимость;
					Продолжить;
				ИначеЕсли  Объем=СтрПорогов.Значение тогда
					СтоимостьАвизацииЗаОбъем=СтрПорогов.стоимость;
					
				иначе
					СтоимостьАвизацииЗаОбъем=ПредыдущееЗначение;
					НашлиСтрочку=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			
			если НашлиСтрочку=ложь тогда
				СтоимостьАвизацииЗаОбъем=ТекТариф.СтоимостьАвизацииЗаОбъем.ПорогиСтоимости.Получить(ТекТариф.СтоимостьАвизацииЗаОбъем.ПорогиСтоимости.Количество()-1).Стоимость;
			КонецЕсли;	
		Иначе
			СтоимостьАвизацииЗаОбъем=0;
		КонецЕсли;		
	КонецЕсли;
	
	
	если ЗначениеЗаполнено(ТекТариф.СтоимостьАвизацииЗаПаллеты) тогда
		//СтоимостьКМЗаПаллеты=0;
		НашлиСтрочку=ложь;
		ПредыдущееЗначение=0;	
		если ТекТариф.СтоимостьАвизацииЗаПаллеты.ПорогиСтоимости.Количество()>0 тогда
			для каждого СтрПорогов из ТекТариф.СтоимостьАвизацииЗаПаллеты.ПорогиСтоимости цикл
				если КоличествоПаллет>СтрПорогов.Значение тогда 
					ПредыдущееЗначение=СтрПорогов.стоимость;
					Продолжить;
				ИначеЕсли  КоличествоПаллет=СтрПорогов.Значение тогда
					СтоимостьАвизацииЗаПаллеты=СтрПорогов.стоимость;
					
				иначе
					СтоимостьАвизацииЗаПаллеты=ПредыдущееЗначение;
					НашлиСтрочку=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			если НашлиСтрочку=ложь тогда
				СтоимостьАвизацииЗаПаллеты=ТекТариф.СтоимостьАвизацииЗаПаллеты.ПорогиСтоимости.Получить(ТекТариф.СтоимостьАвизацииЗаПаллеты.ПорогиСтоимости.Количество()-1).Стоимость;
			КонецЕсли;	
		Иначе
			СтоимостьАвизацииЗаПаллеты=0;
		КонецЕсли;		
	КонецЕсли;
	
	
	
	если ЗначениеЗаполнено(ТекТариф.СтоимостьАвизациизаШтуки) тогда
		//СтоимостьКМзаШтуки=0;
		НашлиСтрочку=ложь;
		ПредыдущееЗначение=0;	
		если ТекТариф.СтоимостьАвизациизаШтуки.ПорогиСтоимости.Количество()>0 тогда
			для каждого СтрПорогов из ТекТариф.СтоимостьАвизациизаШтуки.ПорогиСтоимости цикл
				если КоличествоШтук>СтрПорогов.Значение тогда 
					ПредыдущееЗначение=СтрПорогов.стоимость;
					Продолжить;
				ИначеЕсли  КоличествоШтук=СтрПорогов.Значение тогда
					СтоимостьАвизациизаШтуки=СтрПорогов.стоимость;
					
				иначе
					СтоимостьАвизациизаШтуки=ПредыдущееЗначение;
					НашлиСтрочку=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			если НашлиСтрочку=ложь тогда
				СтоимостьАвизациизаШтуки=ТекТариф.СтоимостьАвизациизаШтуки.ПорогиСтоимости.Получить(ТекТариф.СтоимостьАвизациизаШтуки.ПорогиСтоимости.Количество()-1).Стоимость;
			КонецЕсли;	
		Иначе
			СтоимостьАвизациизаШтуки=0;
		КонецЕсли;		
	КонецЕсли;
	
	//СтоимостьКМзаШтуки=СтоимостьКМзаШтуки*Километраж;	
	//СтоимостьКМЗаПаллеты=СтоимостьКМЗаПаллеты*Километраж;	
	//СтоимостьКМЗаОбъем=СтоимостьКМЗаОбъем*Километраж;	
	
	//если ТекТариф.БазоваяСтоимость>0 тогда
	//	ПоправкаНаШт=СтоимостьКМзаШтуки/ТекТариф.БазоваяСтоимость;
	//	ПоправкаНаПаллет=СтоимостьКМЗаПаллеты/ТекТариф.БазоваяСтоимость;
	//	ПоправкаНаОбъем=СтоимостьКМЗаОбъем/ТекТариф.БазоваяСтоимость;
	//иначе
	//	ПоправкаНаШт=СтоимостьКМзаШтуки;
	//	ПоправкаНаПаллет=СтоимостьКМЗаПаллеты;
	//	ПоправкаНаОбъем=СтоимостьКМЗаОбъем;
	//КонецЕсли;
	
	
	
	
КонецПроцедуры

Процедура РассчитатьПоправкуЗаЭкспедирование(ТекТариф)
	
	СтоимостьЭкспедированияЗаШтуки=0;	
	СтоимостьЭкспедированияЗаПаллеты=0;	
	СтоимостьЭкспедированияЗаОбъем=0;	
	
	если ТекТариф=Справочники.ТарифыДоставки.ПустаяСсылка() тогда
		Возврат;
	КонецЕсли;
	если ложь тогда
		ТекТариф=Справочники.ТарифыДоставки.ПустаяСсылка()
	КонецЕсли;
	
	//Километраж=0;
	//если ПунктДоставки.Километраж>0 тогда
	//	Километраж=ПунктДоставки.Километраж;
	//иначе
	//	Километраж=ПунктДоставки.РайонДоставки.РасстояниеДоСклада;
	//КонецЕсли;
	//
	//если Километраж=0 тогда 
	//	Возврат;
	//КонецЕсли;
	
	
	если ЗначениеЗаполнено(ТекТариф.СтоимостьЭкспедированияЗаОбъем) тогда
		//СтоимостьКМЗаОбъем=0;
		НашлиСтрочку=ложь;
		ПредыдущееЗначение=0;	
		если ТекТариф.СтоимостьЭкспедированияЗаОбъем.ПорогиСтоимости.Количество()>0 тогда
			для каждого СтрПорогов из ТекТариф.СтоимостьЭкспедированияЗаОбъем.ПорогиСтоимости цикл
				если Объем>СтрПорогов.Значение тогда 
					ПредыдущееЗначение=СтрПорогов.стоимость;
					Продолжить;
				ИначеЕсли  Объем=СтрПорогов.Значение тогда
					СтоимостьЭкспедированияЗаОбъем=СтрПорогов.стоимость;
					
				иначе
					СтоимостьЭкспедированияЗаОбъем=ПредыдущееЗначение;
					НашлиСтрочку=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			
			если НашлиСтрочку=ложь тогда
				СтоимостьЭкспедированияЗаОбъем=ТекТариф.СтоимостьЭкспедированияЗаОбъем.ПорогиСтоимости.Получить(ТекТариф.СтоимостьЭкспедированияЗаОбъем.ПорогиСтоимости.Количество()-1).Стоимость;
			КонецЕсли;	
		Иначе
			СтоимостьЭкспедированияЗаОбъем=0;
		КонецЕсли;		
	КонецЕсли;
	
	
	если ЗначениеЗаполнено(ТекТариф.СтоимостьЭкспедированияЗаПаллеты) тогда
		//СтоимостьКМЗаПаллеты=0;
		НашлиСтрочку=ложь;
		ПредыдущееЗначение=0;	
		если ТекТариф.СтоимостьЭкспедированияЗаПаллеты.ПорогиСтоимости.Количество()>0 тогда
			для каждого СтрПорогов из ТекТариф.СтоимостьЭкспедированияЗаПаллеты.ПорогиСтоимости цикл
				если КоличествоПаллет>СтрПорогов.Значение тогда 
					ПредыдущееЗначение=СтрПорогов.стоимость;
					Продолжить;
				ИначеЕсли  КоличествоПаллет=СтрПорогов.Значение тогда
					СтоимостьЭкспедированияЗаПаллеты=СтрПорогов.стоимость;
					
				иначе
					СтоимостьЭкспедированияЗаПаллеты=ПредыдущееЗначение;
					НашлиСтрочку=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			если НашлиСтрочку=ложь тогда
				СтоимостьЭкспедированияЗаПаллеты=ТекТариф.СтоимостьЭкспедированияЗаПаллеты.ПорогиСтоимости.Получить(ТекТариф.СтоимостьЭкспедированияЗаПаллеты.ПорогиСтоимости.Количество()-1).Стоимость;
			КонецЕсли;	
		Иначе
			СтоимостьЭкспедированияЗаПаллеты=0;
		КонецЕсли;		
	КонецЕсли;
	
	
	
	если ЗначениеЗаполнено(ТекТариф.СтоимостьЭкспедированияЗаШтуки) тогда
		//СтоимостьКМзаШтуки=0;
		НашлиСтрочку=ложь;
		ПредыдущееЗначение=0;	
		если ТекТариф.СтоимостьЭкспедированияЗаШтуки.ПорогиСтоимости.Количество()>0 тогда
			для каждого СтрПорогов из ТекТариф.СтоимостьЭкспедированияЗаШтуки.ПорогиСтоимости цикл
				если КоличествоШтук>СтрПорогов.Значение тогда 
					ПредыдущееЗначение=СтрПорогов.стоимость;
					Продолжить;
				ИначеЕсли  КоличествоШтук=СтрПорогов.Значение тогда
					СтоимостьЭкспедированияЗаШтуки=СтрПорогов.стоимость;
					
				иначе
					СтоимостьЭкспедированияЗаШтуки=ПредыдущееЗначение;
					НашлиСтрочку=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			если НашлиСтрочку=ложь тогда
				СтоимостьЭкспедированияЗаШтуки=ТекТариф.СтоимостьЭкспедированияЗаШтуки.ПорогиСтоимости.Получить(ТекТариф.СтоимостьЭкспедированияЗаШтуки.ПорогиСтоимости.Количество()-1).Стоимость;
			КонецЕсли;	
		Иначе
			СтоимостьЭкспедированияЗаШтуки=0;
		КонецЕсли;		
	КонецЕсли;
	
	//СтоимостьКМзаШтуки=СтоимостьКМзаШтуки*Километраж;	
	//СтоимостьКМЗаПаллеты=СтоимостьКМЗаПаллеты*Километраж;	
	//СтоимостьКМЗаОбъем=СтоимостьКМЗаОбъем*Километраж;	
	
	//если ТекТариф.БазоваяСтоимость>0 тогда
	//	ПоправкаНаШт=СтоимостьКМзаШтуки/ТекТариф.БазоваяСтоимость;
	//	ПоправкаНаПаллет=СтоимостьКМЗаПаллеты/ТекТариф.БазоваяСтоимость;
	//	ПоправкаНаОбъем=СтоимостьКМЗаОбъем/ТекТариф.БазоваяСтоимость;
	//иначе
	//	ПоправкаНаШт=СтоимостьКМзаШтуки;
	//	ПоправкаНаПаллет=СтоимостьКМЗаПаллеты;
	//	ПоправкаНаОбъем=СтоимостьКМЗаОбъем;
	//КонецЕсли;
	
	
	
	
КонецПроцедуры


Процедура РассчитатьПоправкуЗаПогрузку(ТекТариф)
	
	СтоимостьПогрузкиЗаШтуки=0;	
	СтоимостьПогрузкиЗаПаллеты=0;	
	СтоимостьПогрузкиЗаОбъем=0;	
	
	если ТекТариф=Справочники.ТарифыДоставки.ПустаяСсылка() тогда
		Возврат;
	КонецЕсли;
	если ложь тогда
		ТекТариф=Справочники.ТарифыДоставки.ПустаяСсылка()
	КонецЕсли;
	
	//Километраж=0;
	//если ПунктДоставки.Километраж>0 тогда
	//	Километраж=ПунктДоставки.Километраж;
	//иначе
	//	Километраж=ПунктДоставки.РайонДоставки.РасстояниеДоСклада;
	//КонецЕсли;
	//
	//если Километраж=0 тогда 
	//	Возврат;
	//КонецЕсли;
	
	
	если ЗначениеЗаполнено(ТекТариф.СтоимостьПогрузкиЗаОбъем) тогда
		//СтоимостьКМЗаОбъем=0;
		НашлиСтрочку=ложь;
		ПредыдущееЗначение=0;	
		если ТекТариф.СтоимостьПогрузкиЗаОбъем.ПорогиСтоимости.Количество()>0 тогда
			для каждого СтрПорогов из ТекТариф.СтоимостьПогрузкиЗаОбъем.ПорогиСтоимости цикл
				если Объем>СтрПорогов.Значение тогда 
					ПредыдущееЗначение=СтрПорогов.стоимость;
					Продолжить;
				ИначеЕсли  Объем=СтрПорогов.Значение тогда
					СтоимостьПогрузкиЗаОбъем=СтрПорогов.стоимость;
					
				иначе
					СтоимостьПогрузкиЗаОбъем=ПредыдущееЗначение;
					НашлиСтрочку=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			
			если НашлиСтрочку=ложь тогда
				//крохин начало 23.03.2019
				//опечатка
				//СтоимостьПогрузкиЗаОбъем=ТекТариф.СтоимостьЭкспедированияЗаОбъем.ПорогиСтоимости.Получить(ТекТариф.СтоимостьПогрузкиЗаОбъем.ПорогиСтоимости.Количество()-1).Стоимость;
				СтоимостьПогрузкиЗаОбъем=ТекТариф.СтоимостьПогрузкиЗаОбъем.ПорогиСтоимости.Получить(ТекТариф.СтоимостьПогрузкиЗаОбъем.ПорогиСтоимости.Количество()-1).Стоимость;
				//крохин конец 23.03.2019
			КонецЕсли;	
		Иначе
			СтоимостьПогрузкиЗаОбъем=0;
		КонецЕсли;		
	КонецЕсли;
	
	
	если ЗначениеЗаполнено(ТекТариф.СтоимостьПогрузкиЗаПаллеты) тогда
		//СтоимостьКМЗаПаллеты=0;
		НашлиСтрочку=ложь;
		ПредыдущееЗначение=0;	
		если ТекТариф.СтоимостьПогрузкиЗаПаллеты.ПорогиСтоимости.Количество()>0 тогда
			для каждого СтрПорогов из ТекТариф.СтоимостьПогрузкиЗаПаллеты.ПорогиСтоимости цикл
				если КоличествоПаллет>СтрПорогов.Значение тогда 
					ПредыдущееЗначение=СтрПорогов.стоимость;
					Продолжить;
				ИначеЕсли  КоличествоПаллет=СтрПорогов.Значение тогда
					СтоимостьПогрузкиЗаПаллеты=СтрПорогов.стоимость;
					
				иначе
					СтоимостьПогрузкиЗаПаллеты=ПредыдущееЗначение;
					НашлиСтрочку=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			если НашлиСтрочку=ложь тогда
				//крохин начало 23.03.2019
				//опечатка
				//СтоимостьПогрузкиЗаПаллеты=ТекТариф.СтоимостьЭкспедированияЗаПаллеты.ПорогиСтоимости.Получить(ТекТариф.СтоимостьПогрузкиЗаПаллеты.ПорогиСтоимости.Количество()-1).Стоимость;
				СтоимостьПогрузкиЗаПаллеты=ТекТариф.СтоимостьПогрузкиЗаПаллеты.ПорогиСтоимости.Получить(ТекТариф.СтоимостьПогрузкиЗаПаллеты.ПорогиСтоимости.Количество()-1).Стоимость;
				//крохин конец 23.03.2019
			КонецЕсли;	
		Иначе
			СтоимостьПогрузкиЗаПаллеты=0;
		КонецЕсли;		
	КонецЕсли;
	
	
	
	если ЗначениеЗаполнено(ТекТариф.СтоимостьПогрузкиЗаШтуки) тогда
		//СтоимостьКМзаШтуки=0;
		НашлиСтрочку=ложь;
		ПредыдущееЗначение=0;	
		если ТекТариф.СтоимостьПогрузкиЗаШтуки.ПорогиСтоимости.Количество()>0 тогда
			для каждого СтрПорогов из ТекТариф.СтоимостьПогрузкиЗаШтуки.ПорогиСтоимости цикл
				если КоличествоШтук>СтрПорогов.Значение тогда 
					ПредыдущееЗначение=СтрПорогов.стоимость;
					Продолжить;
				ИначеЕсли  КоличествоШтук=СтрПорогов.Значение тогда
					СтоимостьПогрузкиЗаШтуки=СтрПорогов.стоимость;
					
				иначе
					СтоимостьПогрузкиЗаШтуки=ПредыдущееЗначение;
					НашлиСтрочку=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			если НашлиСтрочку=ложь тогда
				//крохин начало 23.03.2019
				//опечатка
				//СтоимостьПогрузкиЗаШтуки=ТекТариф.СтоимостьЭкспедированияЗаШтуки.ПорогиСтоимости.Получить(ТекТариф.СтоимостьПогрузкиЗаШтуки.ПорогиСтоимости.Количество()-1).Стоимость;
				СтоимостьПогрузкиЗаШтуки=ТекТариф.СтоимостьПогрузкиЗаШтуки.ПорогиСтоимости.Получить(ТекТариф.СтоимостьПогрузкиЗаШтуки.ПорогиСтоимости.Количество()-1).Стоимость;
				//крохин конец 23.03.2019
			КонецЕсли;	
		Иначе
			СтоимостьПогрузкиЗаШтуки=0;
		КонецЕсли;		
	КонецЕсли;
	
	//СтоимостьКМзаШтуки=СтоимостьКМзаШтуки*Километраж;	
	//СтоимостьКМЗаПаллеты=СтоимостьКМЗаПаллеты*Километраж;	
	//СтоимостьКМЗаОбъем=СтоимостьКМЗаОбъем*Километраж;	
	
	//если ТекТариф.БазоваяСтоимость>0 тогда
	//	ПоправкаНаШт=СтоимостьКМзаШтуки/ТекТариф.БазоваяСтоимость;
	//	ПоправкаНаПаллет=СтоимостьКМЗаПаллеты/ТекТариф.БазоваяСтоимость;
	//	ПоправкаНаОбъем=СтоимостьКМЗаОбъем/ТекТариф.БазоваяСтоимость;
	//иначе
	//	ПоправкаНаШт=СтоимостьКМзаШтуки;
	//	ПоправкаНаПаллет=СтоимостьКМЗаПаллеты;
	//	ПоправкаНаОбъем=СтоимостьКМЗаОбъем;
	//КонецЕсли;
	
	
	
	
КонецПроцедуры

//крохин начало 03.02.2019

Процедура РассчитатьПоправкуЗаДоставкуДоТК(ТекТариф)
	
	СтоимостьДоставкиДоТКЗаШтуки=0;	
	СтоимостьДоставкиДоТКЗаПаллеты=0;	
	СтоимостьДоставкиДоТКЗаОбъем=0;	
	
	если ТекТариф=Справочники.ТарифыДоставки.ПустаяСсылка() тогда
		Возврат;
	КонецЕсли;
	если ложь тогда
		ТекТариф=Справочники.ТарифыДоставки.ПустаяСсылка()
	КонецЕсли;
	
	//крохин начало 09.02.2020
	//иногда надо оплатить доставку до ТК без условий
	Если ОплатитьДоставкуДоТК Тогда
	Иначе
		//крохин конец 09.02.2020	
		//крохин начало 12.04.2019
		//доставка до ТК считается только для автомобилей с категорией автомобиля = "1" и тарифом из ПД, а не региона
		Если Автомобиль.КатегорияАвтомобиля <> "1" Тогда
			Возврат;
		КонецЕсли;
		Если Объем >= ПунктДоставки.ОбъемДляСменыТарифаНаРегиональный Тогда
			Возврат;	
		КонецЕсли;
		//крохин конец 12.04.2019
		//крохин начало 09.02.2020
		//иногда надо оплатить доставку до ТК без условий
	КонецЕсли;
	//крохин конец 09.02.2020
	//Километраж=0;
	//если ПунктДоставки.Километраж>0 тогда
	//	Километраж=ПунктДоставки.Километраж;
	//иначе
	//	Километраж=ПунктДоставки.РайонДоставки.РасстояниеДоСклада;
	//КонецЕсли;
	//
	//если Километраж=0 тогда 
	//	Возврат;
	//КонецЕсли;
	
	
	если ЗначениеЗаполнено(ТекТариф.СтоимостьДоставкиДоТКЗаОбъем) тогда
		//СтоимостьКМЗаОбъем=0;
		НашлиСтрочку=ложь;
		ПредыдущееЗначение=0;	
		если ТекТариф.СтоимостьДоставкиДоТКЗаОбъем.ПорогиСтоимости.Количество()>0 тогда
			для каждого СтрПорогов из ТекТариф.СтоимостьДоставкиДоТКЗаОбъем.ПорогиСтоимости цикл
				если Объем>СтрПорогов.Значение тогда 
					ПредыдущееЗначение=СтрПорогов.стоимость;
					Продолжить;
				ИначеЕсли  Объем=СтрПорогов.Значение тогда
					СтоимостьДоставкиДоТКЗаОбъем=СтрПорогов.стоимость;
					
				иначе
					СтоимостьДоставкиДоТКЗаОбъем=ПредыдущееЗначение;
					НашлиСтрочку=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			
			если НашлиСтрочку=ложь тогда
				//крохин начало 23.03.2019
				//опечатка
				//СтоимостьДоставкиДоТКЗаОбъем=ТекТариф.СтоимостьЭкспедированияЗаОбъем.ПорогиСтоимости.Получить(ТекТариф.СтоимостьДоставкиДоТКЗаОбъем.ПорогиСтоимости.Количество()-1).Стоимость;
				СтоимостьДоставкиДоТКЗаОбъем=ТекТариф.СтоимостьДоставкиДоТКЗаОбъем.ПорогиСтоимости.Получить(ТекТариф.СтоимостьДоставкиДоТКЗаОбъем.ПорогиСтоимости.Количество()-1).Стоимость;
				//крохин конец 23.03.2019
			КонецЕсли;	
		Иначе
			СтоимостьДоставкиДоТКЗаОбъем=0;
		КонецЕсли;		
	КонецЕсли;
	
	
	если ЗначениеЗаполнено(ТекТариф.СтоимостьДоставкиДоТКЗаПаллеты) тогда
		//СтоимостьКМЗаПаллеты=0;
		НашлиСтрочку=ложь;
		ПредыдущееЗначение=0;	
		если ТекТариф.СтоимостьДоставкиДоТКЗаПаллеты.ПорогиСтоимости.Количество()>0 тогда
			для каждого СтрПорогов из ТекТариф.СтоимостьДоставкиДоТКЗаПаллеты.ПорогиСтоимости цикл
				если КоличествоПаллет>СтрПорогов.Значение тогда 
					ПредыдущееЗначение=СтрПорогов.стоимость;
					Продолжить;
				ИначеЕсли  КоличествоПаллет=СтрПорогов.Значение тогда
					СтоимостьДоставкиДоТКЗаПаллеты=СтрПорогов.стоимость;
					
				иначе
					СтоимостьДоставкиДоТКЗаПаллеты=ПредыдущееЗначение;
					НашлиСтрочку=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			если НашлиСтрочку=ложь тогда
				//крохин начало 23.03.2019
				//опечатка
				//СтоимостьДоставкиДоТКЗаПаллеты=ТекТариф.СтоимостьЭкспедированияЗаПаллеты.ПорогиСтоимости.Получить(ТекТариф.СтоимостьДоставкиДоТКЗаПаллеты.ПорогиСтоимости.Количество()-1).Стоимость;
				СтоимостьДоставкиДоТКЗаПаллеты=ТекТариф.СтоимостьДоставкиДоТКЗаПаллеты.ПорогиСтоимости.Получить(ТекТариф.СтоимостьДоставкиДоТКЗаПаллеты.ПорогиСтоимости.Количество()-1).Стоимость;
				//крохин конец 23.03.2019
			КонецЕсли;	
		Иначе
			СтоимостьДоставкиДоТКЗаПаллеты=0;
		КонецЕсли;		
	КонецЕсли;
	
	
	
	если ЗначениеЗаполнено(ТекТариф.СтоимостьДоставкиДоТКЗаШтуки) тогда
		//СтоимостьКМзаШтуки=0;
		НашлиСтрочку=ложь;
		ПредыдущееЗначение=0;	
		если ТекТариф.СтоимостьДоставкиДоТКЗаШтуки.ПорогиСтоимости.Количество()>0 тогда
			для каждого СтрПорогов из ТекТариф.СтоимостьДоставкиДоТКЗаШтуки.ПорогиСтоимости цикл
				если КоличествоШтук>СтрПорогов.Значение тогда 
					ПредыдущееЗначение=СтрПорогов.стоимость;
					Продолжить;
				ИначеЕсли  КоличествоШтук=СтрПорогов.Значение тогда
					СтоимостьДоставкиДоТКЗаШтуки=СтрПорогов.стоимость;
					
				иначе
					СтоимостьДоставкиДоТКЗаШтуки=ПредыдущееЗначение;
					НашлиСтрочку=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			если НашлиСтрочку=ложь тогда
				//крохин начало 23.03.2019
				//опечатка
				//СтоимостьДоставкиДоТКЗаШтуки=ТекТариф.СтоимостьЭкспедированияЗаШтуки.ПорогиСтоимости.Получить(ТекТариф.СтоимостьДоставкиДоТКЗаШтуки.ПорогиСтоимости.Количество()-1).Стоимость;
				СтоимостьДоставкиДоТКЗаШтуки=ТекТариф.СтоимостьДоставкиДоТКЗаШтуки.ПорогиСтоимости.Получить(ТекТариф.СтоимостьДоставкиДоТКЗаШтуки.ПорогиСтоимости.Количество()-1).Стоимость;
				//крохин конец 23.03.2019
			КонецЕсли;	
		Иначе
			СтоимостьДоставкиДоТКЗаШтуки=0;
		КонецЕсли;		
	КонецЕсли;
	
	//СтоимостьКМзаШтуки=СтоимостьКМзаШтуки*Километраж;	
	//СтоимостьКМЗаПаллеты=СтоимостьКМЗаПаллеты*Километраж;	
	//СтоимостьКМЗаОбъем=СтоимостьКМЗаОбъем*Километраж;	
	
	//если ТекТариф.БазоваяСтоимость>0 тогда
	//	ПоправкаНаШт=СтоимостьКМзаШтуки/ТекТариф.БазоваяСтоимость;
	//	ПоправкаНаПаллет=СтоимостьКМЗаПаллеты/ТекТариф.БазоваяСтоимость;
	//	ПоправкаНаОбъем=СтоимостьКМЗаОбъем/ТекТариф.БазоваяСтоимость;
	//иначе
	//	ПоправкаНаШт=СтоимостьКМзаШтуки;
	//	ПоправкаНаПаллет=СтоимостьКМЗаПаллеты;
	//	ПоправкаНаОбъем=СтоимостьКМЗаОбъем;
	//КонецЕсли;
	
	
	
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	//тариф
	СформироватьПроводкиПлановойДоставки(СтоимостьЗаОбъемПланТариф,Справочники.ВидыУслуг.ПланТариф);
	//километраж
	СформироватьПроводкиПлановойДоставки(СтоимостьЗаОбъемПланКилометраж,Справочники.ВидыУслуг.ПланКилометраж);
	//авизация
	СформироватьПроводкиПлановойДоставки(СтоимостьЗаОбъемПланАвизация,Справочники.ВидыУслуг.ПланАвизация);
	//экспедирование
	СформироватьПроводкиПлановойДоставки(СтоимостьЗаОбъемПланЭкспедирование,Справочники.ВидыУслуг.ПланЭкспедирование);
	//погрузка
	СформироватьПроводкиПлановойДоставки(СтоимостьЗаОбъемПланПогрузка,Справочники.ВидыУслуг.ПланПогрузка);
	//доставка до ТК
	СформироватьПроводкиПлановойДоставки(СтоимостьЗаОбъемПланДоставкаДоТК,Справочники.ВидыУслуг.ПланДоставкаДоТК);
КонецПроцедуры

Процедура СформироватьПроводкиПлановойДоставки(РаспределяемаяСтоимость,ВидУслуги)
	//крохин начало 15.04.2019
	Если РаспределяемаяСтоимость = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	//крохин конец 15.04.2019
	ОсталосьРаспределить = РаспределяемаяСтоимость;	
	Для Каждого накл Из СписокНакладных Цикл
		Движение = Движения.ПлановаяСтоимостьДоставки.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
		Если  накл.ПунктДоставки.Пустая() Тогда
			Движение.ПунктДоставки = ПунктДоставки;
		Иначе
			Движение.ПунктДоставки = накл.ПунктДоставки;
		КонецЕсли;
		Движение.ВидУслуги = ВидУслуги;
		Движение.Накладная = накл.Документ;
		движение.ДатаОтгрузки=Накл.Документ.ДатаОтгрузки;
		если накл.Документ.метаданные().имя<>"Перемещение" и накл.Документ.метаданные().имя<>"ЗаявкаВТранспортныйОтдел" тогда
			движение.Контрагент=накл.Документ.Контрагент;
			движение.Подразделение=накл.Документ.Подразделение;
		ИначеЕсли накл.Документ.метаданные().имя="ЗаявкаВТранспортныйОтдел" тогда	
			если накл.Документ.отправитель.Метаданные().Имя="Контрагенты" тогда
				движение.Контрагент=накл.Документ.отправитель;
				движение.Подразделение=накл.Документ.Получатель.Подразделение;
			ИначеЕсли накл.Документ.получатель.Метаданные().Имя="Контрагенты" тогда
				движение.Контрагент=накл.Документ.получатель;
				движение.Подразделение=накл.Документ.Отправитель.Подразделение;
			иначе
				движение.Подразделение=накл.Документ.Получатель.Подразделение;				
			КонецЕсли;
			если накл.Документ.Подразделение<>справочники.Подразделения.ПустаяСсылка() тогда
				движение.Подразделение=накл.Документ.Подразделение;
			КонецЕсли;		
		иначе
			движение.Подразделение=накл.Документ.складполучатель.Подразделение;	
		КонецЕсли;
		если накл.Документ.метаданные().имя<>"ЗаявкаВТранспортныйОтдел" тогда 
			движение.СуммаНакладной=Накл.Документ.СуммаДокумента;
		иначе
			движение.СуммаНакладной=0;
		КонецЕсли;
		
		Движение.ПериодРасходов = Дата;
		
		Движение.ОбъемНаладной = накл.Объем;
		
		Движение.КоличествоКоробок = накл.Документ.КоличествоКоробок;
		Движение.КоличествоНакладной = накл.КоличествоШтук;
		Если Объем <> 0 Тогда
			//крохин начало 15.04.2019	
			// Движение.РаспределеннаяСумма = СтоимостьЗаОбъемПлан*((накл.Объем+0.15*Окр(накл.КоличествоПаллет,0))/Объем);
			Движение.РаспределеннаяСумма = РаспределяемаяСтоимость*((накл.Объем+0.15*Окр(накл.КоличествоПаллет,0))/Объем);
			//крохин конец 15.04.2019
		Иначе
			Движение.РаспределеннаяСумма = 0;
		КонецЕсли;
		ОсталосьРаспределить = ОсталосьРаспределить - Движение.РаспределеннаяСумма;
		
	КонецЦикла;
	Если ОсталосьРаспределить <> 0 Тогда
		Движение.РаспределеннаяСумма = Движение.РаспределеннаяСумма + ОсталосьРаспределить;
	КонецЕсли;
	
КонецПроцедуры

//крохин конец 24.02.2019
